[
  {
    "name": "Vamshi Krishna",
    "designation": "MG Astor Owner",
    "testimonial": "Best experience! The MG Astor purchase was celebrated with cake cutting, crackers, and a video shoot. The entire team at this branch is fabulous!",
    "rating": 4
  },
  {
    "name": "Tejasvi Palaparti",
    "designation": "Software Engineer",
    "testimonial": "Booked my MG Astor in early September and received it in just over 2 months. Sharath, my Relationship Manager, provided exceptional service. The well-maintained showroom with snacks and drinks made the wait comfortable.",
    "rating": 5
  },
  {
    "name": "Pruthvi M",
    "designation": "Business Owner",
    "testimonial": "MG Banjara Hills offers a customer-centric approach. Abhishek from corporate sales was amazing, always available to clarify doubts. A wonderful car buying experience!",
    "rating": 5
  },
  {
    "name": "Pooja Tipirneni",
    "designation": "EV Owner",
    "testimonial": "Ms. Padmavati made my first EV purchase delightful! She explained every feature, coordinated with all departments, and provided personal attention. The MG showroom experience was top-notch!",
    "rating": 4
  },
  {
    "name": "Muralidhar K",
    "designation": "Retired Banker",
    "testimonial": "Smooth experience from deal to delivery. Rajesh's customer-centric support ensured my car arrived right on time. Highly recommend MG Motors!",
    "rating": 5
  },
  {
    "name": "P. Rampurshotham Reddy",
    "designation": "Prospective Buyer",
    "testimonial": "Akhil provided an exceptional test drive experience for the MG Gloster. Patient explanations and no pressure – truly one of the best showrooms in Hyderabad!",
    "rating": 3.3
  },
  {
    "name": "Telugu Lessa",
    "designation": "Car Enthusiast",
    "testimonial": "Friendly staff and spacious parking. However, the waiting period for new cars was longer than expected. Overall a good experience.",
    "rating": 4
  },
  {
    "name": "Priyanka Agarwal",
    "designation": "Customer",
    "testimonial": "Great service from Vinay and Aishwarya during the down payment process. Highly recommend MG for their hardworking team and smooth procedures.",
    "rating": 3.2
  },
  {
    "name": "Prince Shaw",
    "designation": "First-Time Buyer",
    "testimonial": "Aishwarya Gupta explained EV features brilliantly and made my kids feel at home. A highly recommended showroom for car purchases!",
    "rating": 5
  },
  {
    "name": "Megha D",
    "designation": "Hyderabad Resident",
    "testimonial": "Exceptional hospitality during my MG showroom visit. The guest relations team was prompt, kind, and professional. A delightful experience!",
    "rating": 5
  },
  {
    "name": "Suhasini Krishna",
    "designation": "Homemaker",
    "testimonial": "Abdul, Aishwarya, and Niroop were cooperative and efficient. They made my dream of owning an MG Astor come true with their excellent support!",
    "rating": 4.2
  },
  {
    "name": "Nithin Damarancha",
    "designation": "Tech Professional",
    "testimonial": "T. Bharath provided patient support throughout my MG journey. Exceptional delivery experience and timely responses to all queries. Highly satisfied!",
    "rating": 4
  },
  {
    "name": "Mahendra Behera",
    "designation": "Fleet Owner",
    "testimonial": "Saurabh and Sahithi were always available to help. Good explanation and on-time delivery. Looking forward to the same service quality!",
    "rating": 3
  },
  {
    "name": "Nimmy Sakathii",
    "designation": "Freelancer",
    "testimonial": "Quadeer, our service adviser, was super kind and handled all situations expertly. MG's service and hospitality are outstanding!",
    "rating": 4.5
  },
  {
    "name": "Narender Reddy",
    "designation": "Business Owner",
    "testimonial": "The ambience and staff professionalism are top-tier. Majority of the team members understand customer needs perfectly. A premium experience!",
    "rating": 3.5
  }
]